; domain
(define (domain sim_movement_domain)

    (:requirements :strips :action-costs)

    (:types
        location
        enemy
    )

    (:predicates
        (enemy_loc ?enemy - enemy ?loc - location)
        (con ?from ?to - location)          ; locations are connected
        (wall ?loc1 ?loc2 - location)       ; wall between locations
        (blocked ?loc - location)           ; location is blocked by enviroment or other enemy
        (current_turn ?enemy - enemy)
        (next_turn ?enemy_1 ?enemy_2 - enemy)
        (goal_tile ?loc - location)
        (goal_reached ?enemy - enemy)
    )

    (:functions (total-cost) - number)

    (:action move
        :parameters (?from ?to - location ?enemy ?next_enemy - enemy)
        :precondition (and 
            (or (con ?from ?to) (con ?to ?from)) 
            (enemy_loc ?enemy ?from) 
            (current_turn ?enemy) 
            (not (goal_reached ?enemy))
            (next_turn ?enemy ?next_enemy) 
            (not (blocked ?to)) 
            (not (or (wall ?from ?to) (wall ?to ?from))) 
            )
        :effect (and 
            (enemy_loc ?enemy ?to)
            (not (enemy_loc ?enemy ?from))
            (when (not (goal_tile ?to)) 
                (blocked ?to)
            )
            (when (goal_tile ?to) 
                (goal_reached ?enemy)
            )
            (not (blocked ?from))
            (not (current_turn ?enemy))
            (current_turn ?next_enemy)

            (increase (total-cost) 1)
        )
    )
    (:action skip_goal_reached_enemy
        :parameters (?enemy ?next_enemy - enemy)
        :precondition (and 
            (next_turn ?enemy ?next_enemy) 
            (goal_reached ?enemy)
            (current_turn ?enemy) 
        )
        :effect (and 
            (not (current_turn ?enemy))
            (current_turn ?next_enemy)
        )
    )
)

; problem
(define (problem enemy_problem)

    (:domain sim_movement_domain)
    
    (:objects
        a5 b5 c5 d5 e5 
        a4 b4 c4 d4 e4 
        a3 b3 c3 d3 e3 
        a2 b2 c2 d2 e2 
        a1 b1 c1 d1 e1 
         - location
        en0 en1  - enemy
    )
    
    (:init
        (enemy_loc en0 a2) 
        (enemy_loc en1 c1) 

        (next_turn en0 en1)        
        (next_turn en1 en0)

        (current_turn en0)        
        
        ; column connections
        (con a5 a4) (con b5 b4) (con c5 c4) (con d5 d4) (con e5 e4) 
        (con a4 a3) (con b4 b3) (con c4 c3) (con d4 d3) (con e4 e3) 
        (con a3 a2) (con b3 b2) (con c3 c2) (con d3 d2) (con e3 e2) 
        (con a2 a1) (con b2 b1) (con c2 c1) (con d2 d1) (con e2 e1) 
        
        
        
        ; row connections
        (con a5 b5) (con b5 c5) (con c5 d5) (con d5 e5) 
        (con a4 b4) (con b4 c4) (con c4 d4) (con d4 e4) 
        (con a3 b3) (con b3 c3) (con c3 d3) (con d3 e3) 
        (con a2 b2) (con b2 c2) (con c2 d2) (con d2 e2) 
        (con a1 b1) (con b1 c1) (con c1 d1) (con d1 e1) 
        
        
        (blocked e1) 
    )
    
    (:goal
        (or
            (enemy_loc en0 a5) (enemy_loc en1 a5) 
            (enemy_loc en0 e2) (enemy_loc en1 e2) 
        )
    )

)

; plan
1. (move a2 a3 en0 en1)
   deleted: (enemy_loc en0 a2) (current_turn en0)
   added: (enemy_loc en0 a3) (blocked a3) (current_turn en1)
   goals met: 0 of 1
2. (move c1 b1 en1 en0)
   deleted: (enemy_loc en1 c1) (current_turn en1)
   added: (enemy_loc en1 b1) (blocked b1) (current_turn en0)
   goals met: 0 of 1
3. (move a3 a4 en0 en1)
   deleted: (enemy_loc en0 a3) (blocked a3) (current_turn en0)
   added: (enemy_loc en0 a4) (blocked a4) (current_turn en1)
   goals met: 0 of 1
4. (move b1 a1 en1 en0)
   deleted: (enemy_loc en1 b1) (blocked b1) (current_turn en1)
   added: (enemy_loc en1 a1) (blocked a1) (current_turn en0)
   goals met: 0 of 1
5. (move a4 a5 en0 en1)
   deleted: (enemy_loc en0 a4) (blocked a4) (current_turn en0)
   added: (enemy_loc en0 a5) (blocked a5) (current_turn en1)
   goals met: 1 of 1
